# # Packages
brew 'python3'
brew 'ack'
brew 'tree'
brew 'wget'
brew 'neovim'
brew 'git'
brew 'hub'
brew 'tmux'
brew 'zsh'
brew 'markdown'
brew 'graphviz'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'awscli'
brew 'watch'
brew 'reattach-to-user-namespace'
brew 'coreutils'
brew 'htop-osx'
brew 'cmake'
brew 'ccache'
brew 'mackup'
brew 'carthage'
brew 'fastlane'

# Casks
cask_args appdir: '/Applications'
cask 'google-cloud-sdk'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'google-chrome'
cask 'brave-browser'
cask 'spotify'
cask 'alfred'
cask 'hammerspoon'
cask 'android-sdk'
cask 'android-ndk'
cask 'istat-menus'
cask 'iterm2'
cask 'vlc'
cask 'bartender'
cask 'karabiner-elements'
cask 'visual-studio-code'
cask 'skyfonts'
cask 'telegram'
cask 'android-studio'
cask 'docker'
cask 'adobe-creative-cloud'
cask 'miro-formerly-realtimeboard'
cask 'figma'
cask 'phoenix'
cask 'dozer'
cask 'multipass'
cask 'zoomus'

# Drivers
# cask 'logitech-gaming-software'
# cask 'logitech-options'
cask 'hp-easy-start'

# Fonts
cask 'font-fira-code'

# App Store Apps
brew 'mas'
mas 'OmniGraffle', id: 1142578753
mas 'Xcode', id: 497799835
mas 'iA Writer', id: 775737590
mas 'Slack', id: 803453959
mas 'Fantastical 2', id: 975937182
mas '1Password', id: 1333542190
mas 'Pixelmator Pro', id: 1289583905
mas 'Amphetamine', id: 937984704
mas 'Bear', id: 1091189122

# mas 'Trello', id: 1278508951
# mas 'PDF Expert Pro', id: 1055273043
# mas 'PDF Reader Pro', id: 825459243
